{
  "items": [
    {
      "titulo": "Aprendizaje Supervisado",
      "parrafos": [
        "El aprendizaje supervisado, también conocido como machine learning supervisado, se define por el uso de conjuntos de datos etiquetados para entrenar algoritmos para clasificar datos o predecir resultados con precisión.",
        "A medida que los datos de entrada se introducen en el modelo, este ajusta sus pesos hasta que se ajustan adecuadamente. Esto ocurre como parte del proceso de validación cruzada para garantizar que el modelo evite el sobreajuste o el subajuste.",
        "El aprendizaje supervisado ayuda a resolver problemas del mundo real a escala —por ejemplo, clasificar el spam— y emplea métodos como redes neuronales, Naïve Bayes, regresión lineal, regresión logística, bosque aleatorio y máquinas de vectores de soporte (SVM)."
      ]
    },
    {
      "titulo": "Aprendizaje No Supervisado",
      "parrafos": [
        "El aprendizaje no supervisado utiliza algoritmos de machine learning para analizar y agrupar conjuntos de datos sin etiquetar (clústeres). Estos algoritmos descubren patrones ocultos o agrupaciones sin intervención humana.",
        "Es ideal para análisis exploratorio de datos, segmentación de clientes, estrategias de venta cruzada, reconocimiento de imágenes y reducción de dimensionalidad."
      ]
    },
    {
      "titulo": "Aprendizaje por Refuerzo",
      "parrafos": [
        "El aprendizaje por refuerzo es similar al supervisado en su objetivo de optimizar decisiones, pero no se entrena con ejemplos etiquetados. El agente aprende mediante prueba y error, recibiendo recompensas por acciones exitosas y buscando maximizar una política a lo largo del tiempo.",
        "Se aplica en juegos, control robótico, sistemas de recomendación que optimizan secuencias de decisiones y problemas donde la retroalimentación viene en forma de recompensa diferida."
      ]
    }
  ],

  "items2":[
    {
      "titulo":"Reconocimiento de voz",
      "parrafo":"También llamado reconocimiento automático de voz (ASR). Utiliza procesamiento de lenguaje natural (PLN) para convertir habla en texto. Está presente en asistentes y búsquedas por voz (por ejemplo, Siri)."
    }, 
    {
      "titulo":"Atención al cliente",
      "parrafo":"Chatbots y agentes virtuales automatizan respuestas frecuentes, ofrecen asesoramiento, sugerencias y realizan venta cruzada en plataformas de e-commerce y redes sociales."
    },
    {
      "titulo": "Visión artificial",
      "parrafo": " Permite extraer información de imágenes y vídeo. Aplicaciones: etiquetado de fotos, imágenes radiológicas en salud y vehículos autónomos."
    },
    {
      "titulo": "Motores de recomendación",
      "parrafo": "Usan datos de comportamiento para sugerir productos relevantes y mejorar conversiones en minoristas online."
    },
    {
      "titulo": "Automatización Robótica de Procesos (RPA)",
      "parrafo": "Robótica de software que automatiza tareas manuales y repetitivas combinando reglas y ML para decisiones más inteligentes."
    },
    {
      "titulo":"Negociación de acciones automatizada",
      "parrafo": "Plataformas de trading de alta frecuencia y optimización de carteras que ejecutan operaciones sin intervención humana."
    },
    {
      "titulo":"Detección de fraudes",
      "parrafo":" Los bancos entrenan modelos supervisados con transacciones fraudulentas conocidas; la detección de anomalías identifica operaciones atípicas para investigar."
    }
  ],

  "items3":[
    {
      "titulo": "Ventajas",
      "lista": [
        "Precisión en tareas complejas",
        "Escalabilidad",
        "Automatización de procesos"
      ]
    },
    {
      "titulo": "Desafíos",
      "lista": [
        "Necesidad de datos masivos",
        "Sesgos en los datos y modelos",
        "Alto consumo energético"
      ]
    },
    {
       "titulo": "Impacto social",
      "lista": [
        "Oportunidades y transformación laboral",
        "Dilemas éticos: privacidad, deepfakes y desinformación",
        "El reto es hacer que el machine learning sea más transparente, eficiente y responsable"
      ]
    }
  ] 
}